#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2025l-9923/artifactregistry.googleapis.com]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2025l-9923-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2025l-9923-data]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2025l-9923/global/networks/main-vpc]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2025l-9923"/regions/"europe-west1"/zones/<null>]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2025l-9923/global/firewalls/default-internal-allow-all]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2025l-9923/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2025l-9923/regions/europe-west1/routers/nat-router]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2025l-9923/global/firewalls/allow-all-internal]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2025l-9923/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2025l-9923/global/routes/egress-internet]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2025l-9923-code-spark-job.py]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2025l-9923/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2025l-9923/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2025l-9923/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2025l-9923/serviceAccounts/tbd-2025l-9923-data@tbd-2025l-9923.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2025l-9923/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2025l-9923/roles/dataproc.editor/serviceAccount:tbd-2025l-9923-data@tbd-2025l-9923.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2025l-9923/roles/iam.serviceAccountUser/serviceAccount:tbd-2025l-9923-data@tbd-2025l-9923.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2025l-9923/roles/composer.worker/serviceAccount:tbd-2025l-9923-data@tbd-2025l-9923.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2025l-9923-code/roles/storage.objectViewer/serviceAccount:tbd-2025l-9923-data@tbd-2025l-9923.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2025l-9923-data/roles/storage.objectUser/serviceAccount:tbd-2025l-9923-data@tbd-2025l-9923.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2025l-9923/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2025l-9923/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 1s [id=projects/tbd-2025l-9923]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2025l-9923/roles/composer.ServiceAgentV2Ext/serviceAccount:service-512355979210@cloudcomposer-accounts.iam.gserviceaccount.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:ef74725df949347a0a0e9175398bd297a8e530a4fc68e040560491295606e593eu.gcr.io/tbd-2025l-9923/jupyter:3.6.3]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2025l-9923/locations/europe-west1/environments/demo-lab]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:74d2092c42126a2e2a82ab3d63f2a815e0906504c0eb06b5027951ad74abfda0]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2025l-9923/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2025l-9923/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2025l-9923-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2025l-9923-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2025l-9923-conf-scripts/notebook_post_startup_script.sh]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-85f7cd38-bucket-dags/data-dag.py]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-85f7cd38-bucket-dags/dbt-dag.py]
data.google_container_cluster.composer-gke-cluster: Reading...
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:290a486fceb1dca8b950ef5106740bc9029ca5999c0de3e2215606b0c93d154aeu.gcr.io/tbd-2025l-9923/dbt:1.7.13]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:ae1efa200a55757825866c680b64f480c5d568d2d1fe10a7356ab0e47542b482]
data.google_container_cluster.composer-gke-cluster: Read complete after 3s [id=projects/tbd-2025l-9923/locations/europe-west1/clusters/europe-west1-demo-lab-85f7cd38-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id          = "sha256:290a486fceb1dca8b950ef5106740bc9029ca5999c0de3e2215606b0c93d154aeu.gcr.io/tbd-2025l-9923/dbt:1.7.13"
      - name        = "eu.gcr.io/tbd-2025l-9923/dbt:1.7.13" -> null
      - repo_digest = "eu.gcr.io/tbd-2025l-9923/dbt@sha256:ae1efa200a55757825866c680b64f480c5d568d2d1fe10a7356ab0e47542b482" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id          = "sha256:ef74725df949347a0a0e9175398bd297a8e530a4fc68e040560491295606e593eu.gcr.io/tbd-2025l-9923/jupyter:3.6.3"
      - name        = "eu.gcr.io/tbd-2025l-9923/jupyter:3.6.3" -> null
      - repo_digest = "eu.gcr.io/tbd-2025l-9923/jupyter@sha256:74d2092c42126a2e2a82ab3d63f2a815e0906504c0eb06b5027951ad74abfda0" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster must be replaced
-/+ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      ~ effective_labels              = {
          - "goog-dataproc-autozone"          = "enabled"
          - "goog-dataproc-cluster-name"      = "tbd-cluster"
          - "goog-dataproc-cluster-uuid"      = "d651d17b-faf1-4c90-a1a3-22e298571d84"
          - "goog-dataproc-drz-resource-uuid" = "cluster-d651d17b-faf1-4c90-a1a3-22e298571d84"
          - "goog-dataproc-location"          = "europe-west1"
        } -> (known after apply)
      ~ id                            = "projects/tbd-2025l-9923/regions/europe-west1/clusters/tbd-cluster" -> (known after apply)
      - labels                        = {} -> null
      ~ name                          = "tbd-cluster" -> "tbd-cluster-preemptible" # forces replacement
      ~ terraform_labels              = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ cluster_config {
          ~ bucket         = "dataproc-staging-europe-west1-512355979210-wso0i4kw" -> (known after apply)
          ~ temp_bucket    = "dataproc-temp-europe-west1-512355979210-q1ie9u81" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ auxiliary_node_groups (known after apply)

          ~ dataproc_metric_config (known after apply)

          ~ endpoint_config (known after apply)
          - endpoint_config {
              - enable_http_port_access = false -> null
              - http_ports              = {} -> null
            }

          ~ gce_cluster_config {
              + network                = (known after apply)
              ~ service_account_scopes = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> (known after apply)
              ~ subnetwork             = "https://www.googleapis.com/compute/v1/projects/tbd-2025l-9923/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2025l-9923/regions/europe-west1/subnetworks/subnet-01"
              - tags                   = [] -> null
              ~ zone                   = "europe-west1-d" -> (known after apply)
                # (3 unchanged attributes hidden)

              ~ node_group_affinity (known after apply)

              ~ reservation_affinity (known after apply)

              ~ shielded_instance_config (known after apply)
              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = true -> null
                  - enable_vtpm                 = true -> null
                }
            }

          ~ master_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20231001-111635-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-m",
                ] -> (known after apply)
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

          ~ preemptible_worker_config {
              ~ instance_names = [] -> (known after apply)
              ~ num_instances  = 0 -> 1
              + preemptibility = "PREEMPTIBLE" # forces replacement

              ~ disk_config (known after apply)
              - disk_config {}

              ~ instance_flexibility_policy (known after apply)
              - instance_flexibility_policy {
                  - instance_selection_results = [] -> null
                }
            }

          ~ software_config {
              - optional_components = [] -> null
              - override_properties = {} -> null
              ~ properties          = {
                  - "capacity-scheduler:yarn.scheduler.capacity.root.default.ordering-policy"                 = "fair"
                  - "core:fs.gs.block.size"                                                                   = "134217728"
                  - "core:fs.gs.metadata.cache.enable"                                                        = "false"
                  - "core:hadoop.ssl.enabled.protocols"                                                       = "TLSv1,TLSv1.1,TLSv1.2"
                  - "distcp:mapreduce.map.java.opts"                                                          = "-Xmx576m"
                  - "distcp:mapreduce.map.memory.mb"                                                          = "768"
                  - "distcp:mapreduce.reduce.java.opts"                                                       = "-Xmx576m"
                  - "distcp:mapreduce.reduce.memory.mb"                                                       = "768"
                  - "hadoop-env:HADOOP_DATANODE_OPTS"                                                         = "-Xmx512m"
                  - "hdfs:dfs.datanode.address"                                                               = "0.0.0.0:9866"
                  - "hdfs:dfs.datanode.http.address"                                                          = "0.0.0.0:9864"
                  - "hdfs:dfs.datanode.https.address"                                                         = "0.0.0.0:9865"
                  - "hdfs:dfs.datanode.ipc.address"                                                           = "0.0.0.0:9867"
                  - "hdfs:dfs.namenode.handler.count"                                                         = "20"
                  - "hdfs:dfs.namenode.http-address"                                                          = "0.0.0.0:9870"
                  - "hdfs:dfs.namenode.https-address"                                                         = "0.0.0.0:9871"
                  - "hdfs:dfs.namenode.lifeline.rpc-address"                                                  = "tbd-cluster-m:8050"
                  - "hdfs:dfs.namenode.secondary.http-address"                                                = "0.0.0.0:9868"
                  - "hdfs:dfs.namenode.secondary.https-address"                                               = "0.0.0.0:9869"
                  - "hdfs:dfs.namenode.service.handler.count"                                                 = "10"
                  - "hdfs:dfs.namenode.servicerpc-address"                                                    = "tbd-cluster-m:8051"
                  - "mapred-env:HADOOP_JOB_HISTORYSERVER_HEAPSIZE"                                            = "2048"
                  - "mapred:mapreduce.job.maps"                                                               = "9"
                  - "mapred:mapreduce.job.reduce.slowstart.completedmaps"                                     = "0.95"
                  - "mapred:mapreduce.job.reduces"                                                            = "3"
                  - "mapred:mapreduce.jobhistory.recovery.store.class"                                        = "org.apache.hadoop.mapreduce.v2.hs.HistoryServerLeveldbStateStoreService"
                  - "mapred:mapreduce.map.cpu.vcores"                                                         = "1"
                  - "mapred:mapreduce.map.java.opts"                                                          = "-Xmx2621m"
                  - "mapred:mapreduce.map.memory.mb"                                                          = "3277"
                  - "mapred:mapreduce.reduce.cpu.vcores"                                                      = "1"
                  - "mapred:mapreduce.reduce.java.opts"                                                       = "-Xmx2621m"
                  - "mapred:mapreduce.reduce.memory.mb"                                                       = "3277"
                  - "mapred:mapreduce.task.io.sort.mb"                                                        = "256"
                  - "mapred:yarn.app.mapreduce.am.command-opts"                                               = "-Xmx2621m"
                  - "mapred:yarn.app.mapreduce.am.resource.cpu-vcores"                                        = "1"
                  - "mapred:yarn.app.mapreduce.am.resource.mb"                                                = "3277"
                  - "spark-env:SPARK_DAEMON_MEMORY"                                                           = "2048m"
                  - "spark:spark.driver.maxResultSize"                                                        = "1024m"
                  - "spark:spark.driver.memory"                                                               = "2048m"
                  - "spark:spark.executor.cores"                                                              = "1"
                  - "spark:spark.executor.instances"                                                          = "2"
                  - "spark:spark.executor.memory"                                                             = "2893m"
                  - "spark:spark.executorEnv.OPENBLAS_NUM_THREADS"                                            = "1"
                  - "spark:spark.scheduler.mode"                                                              = "FAIR"
                  - "spark:spark.sql.cbo.enabled"                                                             = "true"
                  - "spark:spark.ui.port"                                                                     = "0"
                  - "spark:spark.yarn.am.memory"                                                              = "640m"
                  - "yarn-env:YARN_NODEMANAGER_HEAPSIZE"                                                      = "819"
                  - "yarn-env:YARN_RESOURCEMANAGER_HEAPSIZE"                                                  = "2048"
                  - "yarn-env:YARN_TIMELINESERVER_HEAPSIZE"                                                   = "2048"
                  - "yarn:yarn.nodemanager.address"                                                           = "0.0.0.0:8026"
                  - "yarn:yarn.nodemanager.resource.cpu-vcores"                                               = "2"
                  - "yarn:yarn.nodemanager.resource.memory-mb"                                                = "6554"
                  - "yarn:yarn.resourcemanager.decommissioning-nodes-watcher.decommission-if-no-shuffle-data" = "true"
                  - "yarn:yarn.resourcemanager.nodemanager-graceful-decommission-timeout-secs"                = "86400"
                  - "yarn:yarn.scheduler.maximum-allocation-mb"                                               = "6554"
                  - "yarn:yarn.scheduler.minimum-allocation-mb"                                               = "1"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ worker_config {
              ~ image_uri         = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20231001-111635-rc01" -> (known after apply)
              ~ instance_names    = [
                  - "tbd-cluster-w-0",
                  - "tbd-cluster-w-1",
                ] -> (known after apply)
              ~ min_cpu_platform  = "AUTOMATIC" -> (known after apply)
              ~ min_num_instances = 0 -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ virtual_cluster_config (known after apply)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2025l-9923/dbt:1.7.13"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.13"
              + "PROJECT_NAME"      = "tbd-2025l-9923"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/dbt_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2025l-9923/dbt:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2025l-9923/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2025l-9923"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/jupyter_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2025l-9923/jupyter:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2025l-9923"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook will be created
  + resource "google_notebooks_instance" "tbd_notebook" {
      + create_time            = (known after apply)
      + desired_state          = "ACTIVE"
      + disk_encryption        = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + instance_owners        = [
          + "marek.wiewiorka@gmail.com",
        ]
      + location               = "europe-west1-b"
      + machine_type           = "e2-standard-2"
      + metadata               = {
          + "vmDnsSetting" = "GlobalDefault"
        }
      + name                   = "tbd-2025l-9923-notebook"
      + network                = "projects/tbd-2025l-9923/global/networks/main-vpc"
      + no_proxy_access        = true
      + no_public_ip           = true
      + post_startup_script    = "gs://tbd-2025l-9923-conf/scripts/notebook_post_startup_script.sh"
      + project                = "tbd-2025l-9923"
      + proxy_uri              = (known after apply)
      + service_account        = (known after apply)
      + service_account_scopes = (known after apply)
      + state                  = (known after apply)
      + subnet                 = "projects/tbd-2025l-9923/regions/europe-west1/subnetworks/subnet-01"
      + tags                   = (known after apply)
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + container_image {
          + repository = "eu.gcr.io/tbd-2025l-9923/jupyter"
          + tag        = "3.6.3"
        }

      + shielded_instance_config (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2025l-9923/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:512355979210-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2025l-9923-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:512355979210-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be updated in-place
  ~ resource "google_composer_environment" "composer_env" {
        id               = "projects/tbd-2025l-9923/locations/europe-west1/environments/demo-lab"
        name             = "demo-lab"
        # (5 unchanged attributes hidden)

      ~ config {
            # (8 unchanged attributes hidden)

          ~ software_config {
              ~ env_variables            = {
                  ~ "AIRFLOW_VAR_PHS_CLUSTER"         = "tbd-cluster" -> "tbd-cluster-preemptible"
                    # (6 unchanged elements hidden)
                }
                # (6 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (8 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @hpogorze, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*